---
kind: method
id: M:Autodesk.Revit.DB.STLImportOptions.#ctor(Autodesk.Revit.DB.STLImportOptions)
source: html/57e0b960-da32-24c9-a1bb-d86ec5ba2177.htm
---
# Autodesk.Revit.DB.STLImportOptions.#ctor Method

Constructs a new instance of STLImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public STLImportOptions(
	STLImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.STLImportOptions`) - The STL options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null